:PROPERTIES:
:ID:       736871DB-3544-4BCF-994B-4775D0001377
:END:
#+title: 宇宙线粒子探测与物理实验
** 暗噪声参数
电压 1500V.

# 暗噪声的来源确认。

#+name: darkNoiseF
| 暗噪声频率 (Hz) |
|-----------------|
|           5.224 |
|           10.39 |
|           14.68 |
|            8.75 |
|           10.59 |
|           12.46 |
|           13.52 |
|            8.70 |
|           10.20 |
|            8.69 |
|           10.17 |
|           12.48 |
|            7.10 |
|           18.89 |
|           10.27 |
|            9.66 |
|            7.05 |
|            8.20 |
|            7.70 |
|            8.67 |
|           13.11 |
|           11.47 |
|           14.44 |
|            6.84 |
|            7.79 |
|            9.66 |
|           10.74 |
|           12.02 |
|           11.71 |
|           10.05 |
|            9.91 |
|           10.92 |
|            5.92 |
|            6.48 |
|            8.02 |
|            13.9 |
|            10.2 |
|           10.63 |
|           10.52 |
|           11.02 |
|            2.28 |
|            9.57 |
|           10.35 |
|            9.22 |
|            11.2 |
|           11.75 |
|            8.62 |

#+begin_src python :results output :var darkNoiseF = darkNoiseF
  import numpy as np
  f = [frequency[0] for frequency in darkNoiseF]
  print(np.average(f))
#+end_src

#+RESULTS:
: 10.036893617021276

